Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00/atdf/PIC32CK2051SG00064.atdf
        <register name="DAUTHSTATUS" offset="0x8" rw="R" size="4" access-size="4" caption="Debug Authentication Status Register">
          <bitfield name="NSID" caption="" mask="0x1" values="DAUTHSTATUS__NSID"/>
          <bitfield name="NSNID" caption="" mask="0x4" values="DAUTHSTATUS__NSNID"/>
          <bitfield name="SID" caption="" mask="0x30" values="DAUTHSTATUS__SID"/>
          <bitfield name="SNID" caption="" mask="0xC0" values="DAUTHSTATUS__SNID"/>
        </register>
        <register name="DDEVARCH" offset="0xC" rw="R" size="4" access-size="4" initval="0x47702A04" caption="SCS Device Architecture Register">
          <bitfield name="ARCHPART" caption="Architecture Part" mask="0xFFF"/>
          <bitfield name="ARCHVER" caption="Architecture Version" mask="0xF000"/>
          <bitfield name="REVISION" caption="Revision" mask="0xF0000"/>
          <bitfield name="PRESENT" caption="DEVARCH Present" mask="0x100000"/>
          <bitfield name="ARCHITECT" caption="Architect" mask="0xFFE00000"/>
        </register>
        <register name="DDEVTYPE" offset="0x1C" rw="R" size="4" access-size="4" initval="0x00000000" caption="SCS Device Type Register">
          <bitfield name="MAJOR" caption="Major type" mask="0xF"/>
          <bitfield name="SUB" caption="Sub-type" mask="0xF0"/>
        </register>
        <register name="DPIDR4" offset="0x20" rw="R" size="4" access-size="4" caption="SCS Peripheral Identification Register 4">
          <bitfield name="DES_2" caption="JEP106 continuation code" mask="0xF"/>
          <bitfield name="SIZE" caption="4KB count" mask="0xF0"/>
        </register>
        <register name="DPIDR5" offset="0x24" rw="R" size="4" access-size="4" initval="0x00000000" caption="SCS Peripheral Identification Register 5">
        </register>
        <register name="DPIDR6" offset="0x28" rw="R" size="4" access-size="4" initval="0x00000000" caption="SCS Peripheral Identification Register 6">
        </register>
        <register name="DPIDR7" offset="0x2C" rw="R" size="4" access-size="4" initval="0x00000000" caption="SCS Peripheral Identification Register 7">
        </register>
        <register name="DPIDR0" offset="0x30" rw="R" size="4" access-size="4" caption="SCS Peripheral Identification Register 0">
          <bitfield name="PART_0" caption="Part number bits[7:0]" mask="0xFF"/>
        </register>
        <register name="DPIDR1" offset="0x34" rw="R" size="4" access-size="4" caption="SCS Peripheral Identification Register 1">
          <bitfield name="PART_1" caption="Part number bits[11:8]" mask="0xF"/>
          <bitfield name="DES_0" caption="JEP106 identification code bits [3:0]" mask="0xF0"/>
        </register>
        <register name="DPIDR2" offset="0x38" rw="R" size="4" access-size="4" caption="SCS Peripheral Identification Register 2">
          <bitfield name="DES_1" caption="JEP106 identification code bits[6:4]" mask="0x7"/>
          <bitfield name="JEDEC" caption="JEDEC assignee value is used" mask="0x8"/>
          <bitfield name="REVISION" caption="Component revision" mask="0xF0"/>
        </register>
        <register name="DPIDR3" offset="0x3C" rw="R" size="4" access-size="4" caption="SCS Peripheral Identification Register 3">
          <bitfield name="CMOD" caption="Customer Modified" mask="0xF"/>
          <bitfield name="REVAND" caption="RevAnd" mask="0xF0"/>
        </register>
        <register name="DCIDR0" offset="0x40" rw="R" size="4" access-size="4" initval="0x0000000D" caption="SCS Component Identification Register 0">
          <bitfield name="PRMBL_0" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="DCIDR1" offset="0x44" rw="R" size="4" access-size="4" initval="0x00000090" caption="SCS Component Identification Register 1">
          <bitfield name="PRMBL_1" caption="CoreSight component identification preamble" mask="0xF"/>
          <bitfield name="CLASS" caption="CoreSight component class" mask="0xF0"/>
        </register>
        <register name="DCIDR2" offset="0x48" rw="R" size="4" access-size="4" initval="0x00000005" caption="SCS Component Identification Register 2">
          <bitfield name="PRMBL_2" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
        <register name="DCIDR3" offset="0x4C" rw="R" size="4" access-size="4" initval="0x000000B1" caption="SCS Component Identification Register 3">
          <bitfield name="PRMBL_3" caption="CoreSight component identification preamble" mask="0xFF"/>
        </register>
      </register-group>
      <value-group name="DLAR__KEY">
        <value name="UNLOCK" caption="Unlock key value" value="0xC5ACCE55"/>
      </value-group>
      <value-group name="DAUTHSTATUS__NSID">
        <value name="NO" caption="Non-secure invasive debug prohibited" value="2"/>
        <value name="YES" caption="Non-secure invasive debug allowed" value="3"/>
      </value-group>
      <value-group name="DAUTHSTATUS__NSNID">
        <value name="NO" caption="Non-secure non-invasive debug prohibited" value="2"/>
        <value name="YES" caption="Non-secure non-invasive debug allowed" value="3"/>
      </value-group>
      <value-group name="DAUTHSTATUS__SID">
        <value name="NOSEC" caption="Security Extension not implemented" value="0"/>
        <value name="NO" caption="Secure invasive debug prohibited" value="2"/>
        <value name="YES" caption="Secure invasive debug allowed" value="3"/>
      </value-group>
      <value-group name="DAUTHSTATUS__SNID">
        <value name="NOSEC" caption="Security Extension not implemented" value="0"/>
        <value name="NO" caption="Secure non-invasive debug prohibited" value="2"/>
        <value name="YES" caption="Secure non-invasive debug allowed" value="3"/>
      </value-group>
    </module>
    <module name="DMA" id="03639" name2="dma_axi_apb_v1" version="1b0" caption="Direct Memory Access Controller">
      <register-group name="CHANNEL" size="0x50">
        <register name="CHCTRLA" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="CHANNEL CONTROL REGISTER A">
          <bitfield name="ENABLE" caption="Channel Enable" mask="0x1"/>
          <bitfield name="LLEN" caption="Linked List Enable" mask="0x100"/>
          <bitfield name="SWFRC" caption="Software Forced Trigger" mask="0x10000"/>
          <bitfield name="RUNSTDBY" caption="Run In Standby" mask="0x1000000"/>
        </register>
